app/views/assessments/edit.html.erb

SELECT "users".* FROM "users"
---
<%=form_for @assessment do |f|%>
<p>Select User: <%=f.select :user_id, User.all.map {|user| [user.name, user.id]}%></p>