app/views/workout_logs/edit.html.erb

<%=form_for @workout_log do |f|%>
<p>Select User: <%=f.select :user_id, User.all.map {|user| [user.name, user.id]}%></p>
<p>Select Workout: <%=f.select :workout_id, Workout.all.map {|workout| [workout.workout_type, workout.id]}%></p>
---
SELECT "users".* FROM "users"
SELECT "workouts".* FROM "workouts"