app/views/users/show.html.erb

SELECT "assessments".* FROM "assessments" WHERE "assessments"."user_id" = ?  [["user_id", 1]]
---
<h3>Assessments:</h3>
<%@user.assessments.map do |assessment| %>

SELECT "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."user_id" = ?  [["user_id", 1]]
SELECT "workouts".* FROM "workouts" INNER JOIN "workout_logs" ON "workouts"."id" = "workout_logs"."workout_id" WHERE "workout_logs"."user_id" = ?  [["user_id", 1]]
---
<h3>Workout Logs:</h3>
<%@user.workout_logs.map do |workout_log| %>

SELECT "recovery_logs".* FROM "recovery_logs" WHERE "recovery_logs"."user_id" = ?  [["user_id", 1]]
---
<h3>Recovery Logs:</h3>
<%@user.recovery_logs.map do |recovery_log| %>