app/views/recovery_logs/edit.html.erb

SELECT "users".* FROM "users"
SELECT "recoveries".* FROM "recoveries"
---
<%=form_for @recovery_log do |f|%>
<p>Select User: <%=f.select :user_id, User.all.map {|user| [user.name, user.id]}%></p>
<p>Select Recovery: <%=f.select :recovery_id, Recovery.all.map {|recovery| [recovery.recovery_type, recovery.id]}%></p>