app/controllers/assessments_controller.rb

SELECT  "assessments".* FROM "assessments" WHERE "assessments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @assessment = Assessment.find(params[:id])
        @user = User.find(params[:id])

INSERT INTO "assessments" ("age", "sex", "height", "weight", "body_fat_percent", "health_goal", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @assessment = Assessment.new(assessment_params)
        @assessment.save

SELECT  "assessments".* FROM "assessments" WHERE "assessments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @assessment = Assessment.find(params[:id])

SELECT  "assessments".* FROM "assessments" WHERE "assessments"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "assessments" SET "health_goal" = ?, "updated_at" = ? WHERE "assessments"."id" = ?  [["health_goal", "Maintenance"], ["updated_at", "2020-09-30 14:41:00.764793"], ["id", 13]]
---
    def update
        @assessment = Assessment.find(parmas[:id])
        @assessment.update(assessment_params)

SELECT  "assessments".* FROM "assessments" WHERE "assessments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "assessments" WHERE "assessments"."id" = ?  [["id", 6]]
---
    def destroy
        @assessment = Assessment.find(params[:id])
        @assessment.destroy