app/controllers/recoveries_controller.rb

    def index
        @recoveries = Recovery.all
---
SELECT "recoveries".* FROM "recoveries"