app/controllers/recovery_logs_controller.rb

    def show
        @recovery_log = RecoveryLog.find(params[:id])
---
SELECT  "recovery_logs".* FROM "recovery_logs" WHERE "recovery_logs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @recovery_log = RecoveryLog.new(recovery_log_params)
        @recovery_log.save
---
INSERT INTO "recovery_logs" ("date", "duration", "recovery_points", "user_id", "recovery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["date", "2020-09-30"], ["duration", 72], ["recovery_points", 3], ["user_id", 7], ["recovery_id", 12], ["created_at", "2020-09-30 03:59:53.510096"], ["updated_at", "2020-09-30 03:59:53.510096"]]

    def edit
        @recovery_log = RecoveryLog.find(params[:id])
---
SELECT  "recovery_logs".* FROM "recovery_logs" WHERE "recovery_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def update
        @recovery_log = RecoveryLog.find(params[:id])
        @recovery_log.update(recovery_log_params)
---
SELECT  "recovery_logs".* FROM "recovery_logs" WHERE "recovery_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "recovery_logs" SET "date" = ?, "recovery_points" = ?, "updated_at" = ? WHERE "recovery_logs"."id" = ?  [["date", ""], ["recovery_points", 4], ["updated_at", "2020-09-30 04:15:15.187990"], ["id", 5]]

    def destroy
        @recovery_log = RecoveryLog.find(params[:id])
        @recovery_log.destroy
---
SELECT  "recovery_logs".* FROM "recovery_logs" WHERE "recovery_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "recovery_logs" WHERE "recovery_logs"."id" = ?  [["id", 5]]