app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        #add validations here
        @user.save
---
INSERT INTO "users" ("name", "username", "password", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["username", "test@test.com"], ["password", "test"], ["img_url", ""], ["created_at", "2020-10-01 04:31:12.248435"], ["updated_at", "2020-10-01 04:31:12.248435"]]