app/controllers/workout_logs_controller.rb

    def show
        @workout_log = WorkoutLog.find(params[:id])
---
SELECT  "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @workout_log = WorkoutLog.new(workout_log_params)
        if @workout_log.valid?
            @workout_log.save
---
INSERT INTO "workout_logs" ("date", "duration", "calories_burned", "user_id", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["date", "2020-09-18"], ["duration", 20], ["calories_burned", 275], ["user_id", 7], ["workout_id", 16], ["created_at", "2020-09-30 04:49:50.230530"], ["updated_at", "2020-09-30 04:49:50.230530"]]

    def edit
        @workout_log = WorkoutLog.find(params[:id])
---
SELECT  "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def update
        @workout_log = WorkoutLog.find(params[:id])
        @workout_log.update(workout_log_params)
---
SELECT  "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "workout_logs" SET "date" = ?, "workout_id" = ?, "updated_at" = ? WHERE "workout_logs"."id" = ?  [["date", ""], ["workout_id", 18], ["updated_at", "2020-09-30 05:01:59.208194"], ["id", 5]]

    def destroy
        # byebug
        @workout_log = WorkoutLog.find(params[:id])
        @user = @workout_log.user
        # byebug
        @workout_log.destroy
---
SELECT  "workout_logs".* FROM "workout_logs" WHERE "workout_logs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "workout_logs" WHERE "workout_logs"."id" = ?  [["id", 5]]